#include <iostream>
#include <string>

using namespace std;
string errorcode[51] = {
	"非法字符或者非法标识符", ///0
	"单引号中只允许出现一个字符", ///1
	"!号后只允许出现=",  ///2
	"单引号内只允许出现一个字符",///3
	"符号表已满",//////4
	"函数名或者常量名或者变量名定义重复！",///5
	"函数或过程没有被定义！",////6
	"函数未定义！",/////7
	"标识符未定义",////8
	"函数参数个数不匹配",/////9
	"定义常量或者变量时缺少等号！",////10
	"定义常量或者变量时未给出标识符！",////11
	"等号左边不合法！",////12
	"等号右边不合法！",///13
	"赋值并不合法！",///14
	"缺少分号！",////15
	"缺少类型说明或者类型说明不合法！",////16
	"缺少中括号",////17
	"缺少小括号",///18
	"缺少大括号",/////19
	"有返回值函数缺少返回值",///20
	"无返回值函数定义中有返回值",/////21
	"缺少main函数",///////22
	"复合语句中不允许出现函数定义",////23
	"不合法的语句",//////24
	"缺少冒号",/////25
	"表达式缺失或者错误",////26
	"数组越界"//////27
	"此处应该为标识符"//////28
	"此处应为数字"//////29

};