#include <iostream>
#include <string>

using namespace std;
string errorcode[51] = {
	"非法字符或者非法标识符", ///0
	"单引号中只允许出现一个字符", ///1
	"", 
	"",///3
	"符号表已满",//////4
	"函数名或者常量名或者变量名定义重复！",///5
	"函数或过程没有被定义！",////6
	"函数未定义！",/////7
	"标识符未定义",////8
	"函数参数个数不匹配",/////9
	"定义常量或者变量时缺少等号！",////10
	"定义常量或者变量时未给出标识符！",////11
	"",////12
	"",///13
	"常量不能赋值",///14
	"缺少分号！",////15
	"缺少类型说明或者类型说明不合法！",////16
	"缺少中括号",////17
	"缺少小括号",///18
	"",/////19
	"",///20
	"",/////21
	"缺少复合语句",///////22
	"缺少结束符.",////23
	"缺少of",//////24
	"缺少冒号",/////25
	" ",////26
	"数组越界",//////27
	"此处应该为标识符",//////28
	"此处应为数字",//////29
	"缺少赋值标志",//////30
	
};